In [1]:
# Librerias
# !pip install --user --upgrade "SQLAlchemy>=1.4.16"
import pandas as pd
import seaborn as sns
from sqlalchemy import engine
from pandasql import sqldf
from IPython.display import Image

#Funcion lmmabda que hace escribir funciones en SQL mucho mas faciles
# Revisar esta funcion
pysqldf= lambda q: sqldf(q,globals())

In [7]:
!pip install --user --upgrade "SQLAlchemy>=1.4.16"

Requirement already satisfied: SQLAlchemy>=1.4.16 in c:\users\josefina urquiza\anaconda3\lib\site-packages (2.0.44)
Requirement already satisfied: greenlet>=1 in c:\users\josefina urquiza\anaconda3\lib\site-packages (from SQLAlchemy>=1.4.16) (1.0.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\josefina urquiza\anaconda3\lib\site-packages (from SQLAlchemy>=1.4.16) (4.13.2)

In [21]:
## Importar archivo .csv
jugadores = pd.read_csv("./data/players.csv")
clubes = pd.read_csv("./data/clubs.csv")
valuaciones = pd.read_csv("./data/player_valuations.csv")

In [9]:
jugadores.head()
jugadores.columns

Index(['player_id', 'first_name', 'last_name', 'name', 'last_season',
       'current_club_id', 'player_code', 'country_of_birth', 'city_of_birth',
       'country_of_citizenship', 'date_of_birth', 'sub_position', 'position',
       'foot', 'height_in_cm', 'contract_expiration_date', 'agent_name',
       'image_url', 'url', 'current_club_domestic_competition_id',
       'current_club_name', 'market_value_in_eur',
       'highest_market_value_in_eur'],
      dtype='object')

# SQL en python
### 1. Consultas basicas

In [5]:
#Select * from

q = "SELECT * FROM jugadores"
resultado = pysqldf(q)

# Mostrar las primeras filas
print(resultado.head())
# Vemos todo el df
#print(resultado)

   player_id first_name     last_name                name  last_season  \
0         10   Miroslav         Klose      Miroslav Klose         2015
1         26      Roman  Weidenfeller  Roman Weidenfeller         2017
2         65    Dimitar      Berbatov    Dimitar Berbatov         2015
3         77       None         Lúcio               Lúcio         2012
4         80        Tom        Starke          Tom Starke         2017

   current_club_id         player_code    country_of_birth city_of_birth  \
0              398      miroslav-klose              Poland         Opole
1               16  roman-weidenfeller             Germany          Diez
2             1091    dimitar-berbatov            Bulgaria   Blagoevgrad
3              506               lucio              Brazil      Brasília
4               27          tom-starke  East Germany (GDR)       Freital

  country_of_citizenship  ...   foot height_in_cm contract_expiration_date  \
0                Germany  ...  right        184.0                     None
1                Germany  ...   left        190.0                     None
2               Bulgaria  ...   None          NaN                     None
3                 Brazil  ...   None          NaN                     None
4                Germany  ...  right        194.0                     None

             agent_name                                          image_url  \
0  ASBW Sport Marketing  https://img.a.transfermarkt.technology/portrai...
1      Neubauer 13 GmbH  https://img.a.transfermarkt.technology/portrai...
2       CSKA-AS-23 Ltd.  https://img.a.transfermarkt.technology/portrai...
3                  None  https://img.a.transfermarkt.technology/portrai...
4                   IFM  https://img.a.transfermarkt.technology/portrai...

                                                 url  \
0  https://www.transfermarkt.co.uk/miroslav-klose...
1  https://www.transfermarkt.co.uk/roman-weidenfe...
2  https://www.transfermarkt.co.uk/dimitar-berbat...
3  https://www.transfermarkt.co.uk/lucio/profil/s...
4  https://www.transfermarkt.co.uk/tom-starke/pro...

  current_club_domestic_competition_id  \
0                                  IT1
1                                   L1
2                                  GR1
3                                  IT1
4                                   L1

                                   current_club_name market_value_in_eur  \
0                      Società Sportiva Lazio S.p.A.           1000000.0
1                                  Borussia Dortmund            750000.0
2  Panthessalonikios Athlitikos Omilos Konstantin...           1000000.0
3                             Juventus Football Club            200000.0
4                                  FC Bayern München            100000.0

  highest_market_value_in_eur
0                  30000000.0
1                   8000000.0
2                  34500000.0
3                  24500000.0
4                   3000000.0

[5 rows x 23 columns]

In [13]:
# ----- Where ----- 
# Objetivo: Crear un df de jugadores que esten valuados por mas de $100 mil EU y que sean de Brasil
q = """ SELECT * FROM jugadores 
WHERE country_of_birth = 'Brazil' AND 
market_value_in_eur >= 100000 """

df_ejercicio = pysqldf (q)
df_ejercicio

### Setamos algunas columnas nomas
qb = """ SELECT last_name, country_of_birth, market_value_in_eur FROM jugadores 
WHERE country_of_birth = 'Brazil' AND 
market_value_in_eur >= 100000 """

df_ejercicio = pysqldf (qb)
df_ejercicio

       last_name country_of_birth  market_value_in_eur
0          Lúcio           Brazil             200000.0
1           Dedê           Brazil             400000.0
2        Kuranyi           Brazil            1250000.0
3          Cacau           Brazil             350000.0
4         Vivian           Brazil             100000.0
...          ...              ...                  ...
1453  Caio Gomes           Brazil             250000.0
1454     Fabiano           Brazil             100000.0
1455   Dombroski           Brazil             350000.0
1456  Kauã Elias           Brazil           12000000.0
1457  Pedro Lima           Brazil            5000000.0

[1458 rows x 3 columns]

## Operaciones mas avanzadas
### Group by

In [17]:
jugadores.columns 
q = """
SELECT current_club_name AS club, 
AVG(highest_market_value_in_eur) AS promedio_valor
FROM jugadores
GROUP BY 1
ORDER BY promedio_valor DESC
LIMIT 11
"""

top_10_clubes= pysqldf(q)
top_10_clubes


####

                                 club  promedio_valor
0          Real Madrid Club de Fútbol    4.468673e+07
1               Futbol Club Barcelona    3.725333e+07
2       Manchester City Football Club    3.471059e+07
3   Paris Saint-Germain Football Club    3.317727e+07
4     Manchester United Football Club    2.609440e+07
5             Liverpool Football Club    2.561493e+07
6               Arsenal Football Club    2.504583e+07
7                   FC Bayern München    2.483415e+07
8               Chelsea Football Club    2.160435e+07
9     Tottenham Hotspur Football Club    2.108750e+07
10     Club Atlético de Madrid S.A.D.    1.879691e+07

### HAVING
Misma tabla pero teniendo en cuenta solo clubes con valor promeio menor a 15 millones EU
Se aplica el HAVING y no el WHERE ya que el friltro se aplica sobre el valor ya agrupado.

In [26]:
jugadores.columns 
q = """
SELECT current_club_name AS nombres_del_club, 
AVG(highest_market_value_in_eur) AS promedio_valor
FROM jugadores
GROUP BY 1
HAVING promedio_valor < 15000000
ORDER BY promedio_valor DESC
LIMIT 11
"""

top_10_clubes= pysqldf(q)
top_10_clubes


####

                              nombres_del_club  promedio_valor
0              Nottingham Forest Football Club    1.486900e+07
1                    Associazione Calcio Milan    1.472473e+07
2                                  Calcio Como    1.424141e+07
3               Newcastle United Football Club    1.378200e+07
4                       Sport Lisboa e Benfica    1.368507e+07
5                            Borussia Dortmund    1.295625e+07
6                         Fulham Football Club    1.284754e+07
7                      Brentford Football Club    1.274185e+07
8   Football Club Internazionale Milano S.p.A.    1.269803e+07
9                   Ipswich Town Football Club    1.218966e+07
10                       Everton Football Club    1.212000e+07

### LEFT JOIN

In [27]:
#La llave de ambos df son: a.nombres_del_club = b.name
q = """
SELECT a.*,
b.stadium_name
FROM top_10_clubes A
LEFT JOIN clubes b
ON a.nombres_del_club = b.name
"""
pysqldf(q)

,nombres_del_club,promedio_valor,stadium_name
0,Nottingham Forest Football Club,1.486900e+07,The City Ground
1,Associazione Calcio Milan,1.472473e+07,Giuseppe Meazza
2,Calcio Como,1.424141e+07,Giuseppe Sinigaglia
3,Newcastle United Football Club,1.378200e+07,St James' Park
4,Sport Lisboa e Benfica,1.368507e+07,Estádio da Luz
5,Borussia Dortmund,1.295625e+07,SIGNAL IDUNA PARK
6,Fulham Football Club,1.284754e+07,Craven Cottage
7,Brentford Football Club,1.274185e+07,Gtech Community Stadium
8,Football Club Internazionale Milano S.p.A.,1.269803e+07,Giuseppe Meazza
9,Ipswich Town Football Club,1.218966e+07,Portman Road
10,Everton Football Club,1.212000e+07,Goodison Park

In [1]:
import mysql.connector

# config = {
#     "host": "mysql-5707.dinaserver.com",
#     "port": "3306",
#     "database": "moure_test",
#     "user": "mouredev_read",
#     "password": "mouredev_pass" 
# }

# connection = mysql.connector.connect(**config)
# cursor = connection.cursor()

# query = "SELECT * FROM challenges"
# cursor.execute(query)
# result = cursor.fetchall()

# for row in result:
#     print(row)

# cursor.close()
# connection.close()

ModuleNotFoundError: No module named 'mysql'